EDTДоговоры_ПРОФ_демо/src/Catalogs/Сообщения/Сообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сообщения</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиПоПочте</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Кому</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.ДоговорныеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDTДоговоры_ПРОФ_демо/src/Catalogs/Сообщения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает новое сообщение.
//
// Параметры:
//  Автор - СправочникСсылка.Пользователи - Автор сообщения.
//  Кому - СправочникСсылка.Пользователи - Адресат сообщения.
//  Текст - Строка - Текст сообщения.
//  Предмет - СправочникСсылка.ДоговорныеДокументы - Предмет сообщения.
//
Процедура Добавить(Автор, Кому, Текст, Предмет) Экспорт
	
	КлючеваяОперация = "СообщенияДобавлениеПрограммное";
	ВремяНачала = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(КлючеваяОперация);
	
	Сообщение = Справочники.Сообщения.СоздатьЭлемент();
	Сообщение.Автор = Автор;
	Сообщение.Кому = Кому;
	Сообщение.Текст = Текст;
	Сообщение.Предмет = Предмет;
	Сообщение.Дата = ТекущаяДата();
	
	Сообщение.Записать();
	
	РаботаССообщениями.ЗапуститьРассылкуСообщений();
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремени(КлючеваяОперация, ВремяНачала);
	
КонецПроцедуры

// Устанавливает пометку удаления всем сообщениям с указанным предметом.
//
// Параметры:
//  Предмет - СправочникСсылка.ДоговорныеДокументы - Предмет сообщений.
//
Процедура ПометитьНаУдалениеПоПредмету(Предмет) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		ЗаписьУжеЕстьВБазе = Ложь;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.Сообщения");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Предмет", Предмет);
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Сообщения.Ссылка
			|ИЗ
			|	Справочник.Сообщения КАК Сообщения
			|ГДЕ
			|	Сообщения.Предмет = &Предмет
			|	И Сообщения.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Предмет", Предмет);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СообщениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СообщениеОбъект.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
